Repository: juntook/Mothball
Catalog: App/Localizable.xcstrings
Source language: en
Languages: zh_hans

# settings.directDelete
source: Delete regenerable items directly
zh_hans: 直接删除可再生条目

# settings.directDelete.detail
source: Skip the Trash for caches and build artifacts. The first direct delete in each session asks again.
zh_hans: 缓存与构建产物不经过废纸篓。每次会话的首次直接删除会再次确认。

# settings.directDelete.userDataNote
source: User data (session history, todos) always goes to the Trash regardless of this setting.
zh_hans: 无论此设置如何,用户数据(会话历史、任务清单)始终进入废纸篓。

# settings.doctor.detail
source: Doctor shows every rule target's on-disk reality — the workbench for verifying draft rules.
zh_hans: Doctor 面板逐条展示规则在本机的真实情况,是核实 draft 规则的工作台。

# settings.exclusions.add
source: Add Exclusion…
zh_hans: 添加排除目录…

# settings.exclusions.detail
source: Projects inside excluded directories are not discovered.
zh_hans: 排除目录内不会发现项目。

# settings.language
source: Language
zh_hans: 界面语言

# settings.language.detail
source: Takes effect immediately. Numbers and dates follow the system region.
zh_hans: 切换即时生效;数字与日期格式跟随系统地区设置。

# settings.language.system
source: System Default
zh_hans: 跟随系统

# settings.menuBar
source: Show menu bar icon
zh_hans: 显示菜单栏图标

# settings.menuBar.detail
source: Quick summary and session actions in the menu bar.
zh_hans: 在菜单栏提供摘要与会话快捷操作。

# settings.notify.longRunning
source: Services running longer than 8 hours
zh_hans: 服务运行超过 8 小时时提醒

# settings.notify.note
source: Storage alerts fire at most once a week; service alerts at most once a day.
zh_hans: 存储提醒每周至多一次;服务提醒每天至多一次。

# settings.notify.space
source: Reclaimable space exceeds threshold
zh_hans: 可释放空间超过阈值时提醒

# settings.notify.threshold %lld
source: Threshold: %lld GB
zh_hans: 阈值:%lld GB

# settings.notify.unavailable
source: Notifications require the bundled app (they are unavailable in a bare development run).
zh_hans: 通知需要打包后的应用才可用(裸开发运行下不可用)。

# settings.openAuditLog
source: Show operations.jsonl in Finder
zh_hans: 在访达中显示 operations.jsonl

# settings.privacy.note
source: All analysis happens locally. The audit log records every operation and never leaves this Mac.
zh_hans: 所有分析在本机完成;审计日志记录每次操作,不会离开这台电脑。

# settings.protection.detail
source: Protected objects never join batch operations, start unchecked, and show a lock badge. User protection outranks automatic recommendations.
zh_hans: 受保护对象不会进入批量操作、默认不勾选并显示锁标。用户保护优先于自动推荐。

# settings.scanFrequency
source: Scheduled scan
zh_hans: 定时扫描

# settings.scanFrequency.daily
source: Daily
zh_hans: 每天

# settings.scanFrequency.manual
source: Manual only
zh_hans: 仅手动

# settings.scanFrequency.note
source: Scheduled scans only produce a report — nothing is ever deleted automatically.
zh_hans: 定时扫描只生成报告,绝不会自动删除任何内容。

# settings.scanFrequency.weekly
source: Weekly
zh_hans: 每周

# settings.section.advanced
source: Advanced
zh_hans: 高级

# settings.section.codeRoots
source: Code roots
zh_hans: 代码根目录

# settings.section.exclusions
source: Excluded Directories
zh_hans: 排除目录

# settings.section.general
source: General
zh_hans: 常规

# settings.section.ignored
source: Ignored paths
zh_hans: 已忽略的路径

# settings.section.language
source: Language & Region
zh_hans: 语言与地区

# settings.section.notifications
source: Notifications
zh_hans: 通知

# settings.section.privacy
source: Privacy & Updates
zh_hans: 隐私与更新

# settings.section.protection
source: Protection Rules
zh_hans: 保护规则

# settings.update.autoCheck
source: Automatically check for updates
zh_hans: 自动检查更新

# settings.update.autoDownload
source: Automatically download and install updates
zh_hans: 自动下载并安装更新

# settings.update.unavailable
source: Updates work in the signed, released app (via GitHub Releases). They are unavailable in local unsigned builds.
zh_hans: 更新功能在正式签名发布的版本中可用(通过 GitHub Releases 分发);本地未签名构建暂不可用。

# sidebar.activeResources
source: Active Resources
zh_hans: 活动资源

# sidebar.aiTools
source: AI Tools
zh_hans: AI 工具

# sidebar.history
source: History
zh_hans: 历史记录

# sidebar.overview
source: Overview
zh_hans: 概览

# sidebar.sessions
source: Sessions
zh_hans: 开发会话

# sidebar.settings
source: Settings
zh_hans: 设置

# sidebar.storage
source: Storage
zh_hans: 磁盘空间

# storage.groupSelect.help
source: Select or clear every regenerable item in this group
zh_hans: 全选/清除该组的全部可再生项目

# storage.selectLowRisk
source: Select Low-Risk
zh_hans: 全选低风险项

# storage.selectLowRisk.help
source: Add every low-risk regenerable item to the selection. Session history and other user data always stay opt-in.
zh_hans: 将所有低风险的可再生项目加入选择。会话历史等用户数据始终需要逐项勾选。

# storage.selection %lld %@
source: %lld selected · %@ reclaimable
zh_hans: 已选择 %lld 项 · 预计释放 %@

# storage.selection.clear
source: Deselect All
zh_hans: 取消选择

# storage.selection.review
source: Review & Clean…
zh_hans: 查看影响并清理…

# storage.summary %@ %lld
source: Reclaimable %@ · %lld projects
zh_hans: 可释放 %@ · %lld 个项目

# storage.tab.docker
source: Docker
zh_hans: Docker 存储

# storage.tab.projects
source: Project Artifacts
zh_hans: 项目产物

# storage.tab.toolCaches
source: Tool Caches
zh_hans: 工具缓存

# toolbar.endSession
source: End Dev Session
zh_hans: 结束开发会话

# toolbar.scan
source: Scan
zh_hans: 扫描

# toolbar.scanning
source: Scanning…
zh_hans: 正在扫描…

# tools.empty.description
source: Click Scan in the toolbar to measure what your dev tools are using.
zh_hans: 点击工具栏中的「扫描」,查看各开发工具的磁盘占用。

# tools.empty.title
source: No scan results
zh_hans: 暂无扫描结果

# tools.error.title
source: Rules failed to load
zh_hans: 规则加载失败

# tools.total
source: Total
zh_hans: 合计
